# Table of Contents
## Step 3. Importing libraries and data
## Step 4. Data wrangling
## Step 5. Data quality and consistency checks
## Step 6 Combine customer data with the rest of Instacart data
## Step 8. Export the merged dataframe

# Step 3. Importing libraries and data

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create shortcut to import files from project folder

path = r'C:\Users\radav\OneDrive\Documents\Career Foundry\Data Analytics\Immersion\Achievement 4 Python Fundamentals\Instacart Basket Analysis'

In [3]:
# Import customers file

df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

# Step 4. Data wrangling

In [4]:
# Check customers dataframe

df.shape

(206209, 10)

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Re-name First Name column to match consistent column heading format

df.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [7]:
# Re-name Surnam column to correct spelling

df.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [8]:
# Re-name gender column to match consistent column heading format

df.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [9]:
# Re-name State column to match consistent column heading format

df.rename(columns = {'STATE' : 'state'}, inplace = True)

In [10]:
# Re-name Age column to match consistent column heading format

df.rename(columns = {'Age' : 'age'}, inplace = True)

In [11]:
# Re-name n_dependants column to more intuitive name and correct spelling

df.rename(columns = {'n_dependants' : 'number_of_dependents'}, inplace = True)

In [12]:
# Re-check output for column name changes

df.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 5. Data quality and consistency checks

In [13]:
# Check 'user_id' data type

df['user_id'].dtype

dtype('int64')

In [14]:
# Convert 'user_id' to string

df['user_id'] = df['user_id'].astype('str')

In [15]:
# Check for mixed-type data

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

first_name

In [16]:
# Convert numeric values in 'first_name' column to string

df['first_name'] = df['first_name'].astype('str')

In [17]:
# Re-check for mixed-type data

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

In [18]:
# Create duplicates dataframe to identify duplicates in customers dataframe

df_dups = df[df.duplicated()]

In [19]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, number_of_dependents, fam_status, income]
Index: []

#### No duplicates found in customers file.

In [20]:
# Find missing values in customers dataframe

df.isnull().sum()

user_id                 0
first_name              0
surname                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependents    0
fam_status              0
income                  0
dtype: int64

#### No missing values found in customers file.

In [21]:
# Run the describe function on the dataframe

df.describe()

                 age  number_of_dependents         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

#### All of the data looks reasonable for each numeric column. For example, total counts are accurate and min, max and mean values are reasonable.

In [22]:
# Re-name dataframe

df_cust_clean = df

In [23]:
# Export the clean customers file in pickle format to keep a record

df_cust_clean.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_clean.pkl'))

# Step 6 Combine customer data with the rest of Instacart data

In [24]:
# Import latest orders_products working file

df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_new_flags.pkl'))

In [25]:
# Check ords_prods dataframe

df_ords_prods.shape

(32404859, 23)

In [26]:
df_ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,...,prices,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,spending_flag,median_days_since_prior_order,order_frequency_flag
0,2539329,1,1,2,8,NaN,New,196,1,0,...,9.0,Mid-range product,Regular day,Fewest orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,Existing,196,1,1,...,9.0,Mid-range product,Slow day,Fewest orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,Existing,196,1,1,...,9.0,Mid-range product,Slow day,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,Existing,196,1,1,...,9.0,Mid-range product,Slow day,Fewest orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,Existing,196,1,1,...,9.0,Mid-range product,Slow day,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [27]:
# Check 'user_id' data type to use as key

df_ords_prods['user_id'].dtype

dtype('int64')

In [28]:
# Convert 'user_id' to string

df_ords_prods['user_id'] = df_ords_prods['user_id'].astype('str')

In [29]:
# Merge df_cust_clean and df_ords_prods dataframes

df_merged = df_cust_clean.merge(df_ords_prods, on = 'user_id', indicator = True)

In [30]:
# Check the output

df_merged.shape

(32404859, 33)

In [31]:
df_merged.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependents,fam_status,income,...,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,spending_flag,median_days_since_prior_order,order_frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Busy day,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regular day,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Busy day,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regular day,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Slow day,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [32]:
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [33]:
# Check names of all columns in merged dataframe by checking for missing values

df_merged.isnull().sum()

user_id                                0
first_name                             0
surname                                0
gender                                 0
state                                  0
age                                    0
date_joined                            0
number_of_dependents                   0
fam_status                             0
income                                 0
order_id                               0
order_number                           0
orders_day_of_week                     0
order_hour_of_day                      0
days_since_prior_order           2076096
customer_status                        0
product_id                             0
add_to_cart_order                      0
reordered                              0
product_name                           0
aisle_id                               0
department_id                          0
prices                              5127
price_range_loc                        0
busiest_days                           0
busiest_period_of_day                  0
max_order                              0
loyalty_flag                           0
avg_product_price                      0
spending_flag                          0
median_days_since_prior_order          5
order_frequency_flag                   5
_merge                                 0
dtype: int64

In [34]:
# Check the value counts for 'order_number' = 1 to confirm that missing values in days_since_prior_order column relate to customers' first orders where there are no prior orders

df_merged['order_number'].value_counts()[1]

2076096

In [35]:
# Drop '_merge' column

df_merged = df_merged.drop(columns = ['_merge'])

In [36]:
# Re-check shape of merged dataframe

df_merged.shape

(32404859, 32)

# Step 8. Export the merged dataframe

In [37]:
# Export the merged dataframe in pickle format as 'orders_products_customers_combined.pkl'

df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))